Tekla.Structures.Model.BaseRebarGroup.RebarGroupTypeEnum
The different stirrup types.

Tekla.Structures.Model.BaseRebarGroup.RebarGroupTypeEnum.GROUP
The group subtype.

Tekla.Structures.Model.BaseRebarGroup.RebarGroupTypeEnum.CURVED
The curved subtype.

Tekla.Structures.Model.BaseRebarGroup.RebarGroupTypeEnum.CIRCLE
The circle subtype.